# csv文件读写

In [1]:
import numpy as np
import pandas as pd 
import os

In [2]:
#修改文件路径
os.chdir(r'F:\python\数据清洗课程材料\代码和数据')

In [3]:
#获得当前路径地址
os.getcwd()

'F:\\python\\数据清洗课程材料\\代码和数据'

In [4]:
#设置最大显示列数
pd.set_option('display.max_columns', 20)
#设置最大显示行数
pd.set_option('display.max_rows', 50)

In [5]:
#读取baby用户信息
baby = pd.read_csv('sam_tianchi_mum_baby.csv', encoding='utf-8')

In [6]:
#查看婴儿表表信息
baby.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 953 entries, 0 to 952
Data columns (total 3 columns):
user_id     953 non-null int64
birthday    953 non-null int64
gender      953 non-null int64
dtypes: int64(3)
memory usage: 22.4 KB

In [11]:
#数值类型的常用统计值
baby.describe()
baby.describe(include='all')

            user_id      birthday      gender
count  9.530000e+02  9.530000e+02  953.000000
mean   4.578517e+08  2.011790e+07    0.514166
std    5.003048e+08  2.271788e+04    0.551981
min    2.757000e+03  1.984062e+07    0.000000
25%    7.575808e+07  2.011030e+07    0.000000
50%    2.773575e+08  2.012083e+07    0.000000
75%    7.149198e+08  2.013101e+07    1.000000
max    2.391405e+09  2.015082e+07    2.000000

In [20]:
#查看婴儿表前10行信息
baby.head(10)

    user_id  birthday  gender
0      2757  20130311       1
1    415971  20121111       0
2   1372572  20120130       1
3  10339332  20110910       0
4  10642245  20130213       0
5  10923201  20110830       1
6  11768880  20120107       1
7  12519465  20130705       1
8  12950574  20090708       0
9  13735440  20120323       0

In [15]:
#查看各列非空值数量
baby.count()
baby1 = baby.copy(deep=True)
baby1.isnull().sum()

user_id     0
birthday    0
gender      0
dtype: int64

In [26]:
#导入订单数据
#编码为gbk中文编码  加载数据之前可以先读一下这个文件进行大体掌握
order = pd.read_csv('meal_order_info.csv',encoding= 'gbk', dtype={'info_id':str,'emp_id':str})

In [28]:
order.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 945 entries, 0 to 944
Data columns (total 21 columns):
info_id               945 non-null object
emp_id                945 non-null object
number_consumers      945 non-null int64
mode                  0 non-null float64
dining_table_id       945 non-null int64
dining_table_name     945 non-null int64
expenditure           945 non-null int64
dishes_count          945 non-null int64
accounts_payable      945 non-null int64
use_start_time        945 non-null object
check_closed          0 non-null float64
lock_time             936 non-null object
cashier_id            0 non-null float64
pc_id                 0 non-null float64
order_number          0 non-null float64
org_id                945 non-null int64
print_doc_bill_num    0 non-null float64
lock_table_info       0 non-null float64
order_status          945 non-null int64
phone                 945 non-null int64
name                  945 non-null object
dtypes: float64(7), int64(9), object(5)
memory usage: 155.1+ KB

In [ ]:
order

In [36]:
#仅取读文件的前100行
baby_trade_history = pd.read_csv('baby_trade_history.csv',nrows=100)

In [ ]:
baby_trade_history

In [ ]:
#保存数据
baby_trade_history.to_csv('a1.csv',encoding='utf-8',index=False)

# excel文件读写

In [52]:
#订单数据
#读取excel需要注明具体哪一个工作簿,否则就是第一个工作簿
df1 = pd.read_excel('meal_order_detail.xlsx',encoding = 'utf-8',sheet_name = 'meal_order_detail1')

In [ ]:
df1

In [50]:
# sheet_name可以为数字，代表第几个工作簿
df1 = pd.read_excel('meal_order_detail.xlsx',encoding = 'utf-8',sheet_name=0)

In [51]:
df1.head(5)

,detail_id,order_id,dishes_id,logicprn_name,parent_class_name,dishes_name,itemis_add,counts,amounts,cost,place_order_time,discount_amt,discount_reason,kick_back,add_inprice,add_info,bar_code,picture_file,emp_id
0,2956,417,610062,NaN,NaN,蒜蓉生蚝,0,1,49,NaN,2016-08-01 11:05:36,NaN,NaN,NaN,0,NaN,NaN,caipu/104001.jpg,1442
1,2958,417,609957,NaN,NaN,蒙古烤羊腿\r\n\r\n\r\n,0,1,48,NaN,2016-08-01 11:07:07,NaN,NaN,NaN,0,NaN,NaN,caipu/202003.jpg,1442
2,2961,417,609950,NaN,NaN,大蒜苋菜,0,1,30,NaN,2016-08-01 11:07:40,NaN,NaN,NaN,0,NaN,NaN,caipu/303001.jpg,1442
3,2966,417,610038,NaN,NaN,芝麻烤紫菜,0,1,25,NaN,2016-08-01 11:11:11,NaN,NaN,NaN,0,NaN,NaN,caipu/105002.jpg,1442
4,2968,417,610003,NaN,NaN,蒜香包,0,1,13,NaN,2016-08-01 11:11:30,NaN,NaN,NaN,0,NaN,NaN,caipu/503002.jpg,1442

In [55]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2779 entries, 0 to 2778
Data columns (total 19 columns):
detail_id            2779 non-null int64
order_id             2779 non-null int64
dishes_id            2779 non-null int64
logicprn_name        0 non-null float64
parent_class_name    0 non-null float64
dishes_name          2779 non-null object
itemis_add           2779 non-null int64
counts               2779 non-null int64
amounts              2779 non-null int64
cost                 0 non-null float64
place_order_time     2779 non-null datetime64[ns]
discount_amt         0 non-null float64
discount_reason      0 non-null float64
kick_back            0 non-null float64
add_inprice          2779 non-null int64
add_info             0 non-null float64
bar_code             0 non-null float64
picture_file         2779 non-null object
emp_id               2779 non-null int64
dtypes: datetime64[ns](1), float64(8), int64(8), object(2)
memory usage: 412.6+ KB

In [57]:
#保存数据
df1.to_excel('a1.xlsx',sheet_name='one',index=False)

# 数据库文件的读

In [61]:
#导入相关数据库
import pymysql
from sqlalchemy import create_engine

按实际情况依次填写MySQL的用户名、密码、IP地址、端口、数据库名

create_engine('mysql+pymysql://user:passward@IP:3306/test01')
root 用户名
passward --密码
IP : 服务区IP
3306： 端口号
test01 :数据库名称

In [64]:
#建立连接
conn = create_engine('mysql+pymysql://root:0817@localhost:3306/myemployees')

conn = create_engine("mysql+pymysql://{}:{}@{}:{}/{}?charset=gbk".format('root', 'ly200689081', 'localhost', '3306', 'test01'))

In [65]:
#取读数据
#选择数据库中的表名
sql = 'select * from employees'
df2 = pd.read_sql(sql,conn)
#df2是一个DataFrame格式

D:\Program Files (x86)\anaconda\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 1")
  result = self._query(query)

In [67]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 107 entries, 0 to 106
Data columns (total 11 columns):
employee_id       107 non-null int64
first_name        107 non-null object
last_name         107 non-null object
email             107 non-null object
phone_number      107 non-null object
job_id            107 non-null object
salary            107 non-null float64
commission_pct    35 non-null float64
manager_id        106 non-null float64
department_id     106 non-null float64
hiredate          107 non-null datetime64[ns]
dtypes: datetime64[ns](1), float64(4), int64(1), object(5)
memory usage: 9.3+ KB

In [68]:
# # # 函数
def query(table):
    host = 'localhost'
    user = 'root'
    password = '0817'
    database = 'myemployees'
    port = 3306
    conn = create_engine("mysql+pymysql://{}:{}@{}:{}/{}".format(user, password, host, port, database))
    #SQL语句，可以定制，实现灵活查询
    sql = 'select * from ' + table  #选择数据库中表名称    
    # 使用pandas 的read_sql函数，可以直接将数据存放在dataframe中
    results = pd.read_sql(sql,conn)
    return results

In [70]:
query('jobs')

D:\Program Files (x86)\anaconda\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 1")
  result = self._query(query)

        job_id                        job_title  min_salary  max_salary
0   AC_ACCOUNT                Public Accountant        4200        9000
1       AC_MGR               Accounting Manager        8200       16000
2      AD_ASST         Administration Assistant        3000        6000
3      AD_PRES                        President       20000       40000
4        AD_VP    Administration Vice President       15000       30000
5   FI_ACCOUNT                       Accountant        4200        9000
6       FI_MGR                  Finance Manager        8200       16000
7       HR_REP   Human Resources Representative        4000        9000
8      IT_PROG                       Programmer        4000       10000
9       MK_MAN                Marketing Manager        9000       15000
10      MK_REP         Marketing Representative        4000        9000
11      PR_REP  Public Relations Representative        4500       10500
12    PU_CLERK                 Purchasing Clerk        2500        5500
13      PU_MAN               Purchasing Manager        8000       15000
14      SA_MAN                    Sales Manager       10000       20000
15      SA_REP             Sales Representative        6000       12000
16    SH_CLERK                   Shipping Clerk        2500        5500
17    ST_CLERK                      Stock Clerk        2000        5000
18      ST_MAN                    Stock Manager        5500        8500

In [73]:
# # # 函数
def query(database,table):
    host = 'localhost'
    user = 'root'
    password = '0817'
    port = 3306
    conn = create_engine("mysql+pymysql://{}:{}@{}:{}/{}".format(user, password, host, port, database))
    #SQL语句，可以定制，实现灵活查询
    sql = 'select * from ' + table  #选择数据库中表名称    
    # 使用pandas 的read_sql函数，可以直接将数据存放在dataframe中
    results = pd.read_sql(sql,conn)
    return results

In [74]:
query('my_test','student')

D:\Program Files (x86)\anaconda\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 1")
  result = self._query(query)

   sno sname ssex  sbirthday  class
0  108    曾华    男 1977-09-01  95033
1  105    匡明    男 1975-10-02  95031
2  107    王丽    女 1976-01-23  95033
3  101    李军    男 1976-02-20  95033
4  109    王芳    女 1975-02-10  95031
5  103    陆君    男 1974-06-03  95031

数据保存
df.to_sql(name, con=engine, if_exists='replace/append/fail',index=False)
name是表名
con是连接
if_exists：表如果存在怎么处理 -- append：追加 -- replace：删除原表，建立新表再添加 -- fail：什么都不干
index=False：不插入索引index

In [76]:
os.getcwd()

'F:\\python\\数据清洗课程材料\\代码和数据'

In [77]:
df3 = pd.read_csv('baby_trade_history.csv')

In [79]:
try:
    df3.to_sql('testdf',con = conn, index= False,if_exists= 'replace')
except:
    print('error')

Python是否能将数据写入数据库，很多时候取决于数据库的权限